src/cf/src/InformationRegisters/Лиды/Лиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лиды</name>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Канал</name>
    <type>
      <types>CatalogRef.Каналы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЛидов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/Лиды/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// Печать заказа и накладной по лиду интернет-магазина.
// Формы перенесены из модуля формы записи в подсистему печатных форм
// (конвенция ДобавитьКомандыПечати/Печать): печатается заказ покупателя лида,
// а телефон и почта покупателя приходят в параметрах команды печати.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы лида.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Для Каждого Описание Из ОписанияПечатныхФорм() Цикл
		Команда = КомандыПечати.Добавить();
		Команда.ИмяМакета = Описание.ИмяМакета;
		Команда.Представление = Описание.Представление;
	КонецЦикла;

КонецПроцедуры

// Формирует запрошенные печатные формы лида.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - заказы покупателя, оформленные по лидам
//  ПараметрыПечати       - Структура       - НомерТелефона и EMail покупателя из карточки лида
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие заказов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Контакты = Новый Структура("НомерТелефона, EMail", "", "");
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Контакты, ПараметрыПечати);
	КонецЕсли;

	Для Каждого Описание Из ОписанияПечатныхФорм() Цикл
		Если Не ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, Описание.ИмяМакета) Тогда
			Продолжить;
		КонецЕсли;

		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ВывестиПечатнуюФорму(Описание.ИмяМакета, Док, Таб, Контакты);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;

		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, Описание.ИмяМакета,
			Описание.Представление, Таб, Описание.ПутьКМакету);
		УстановитьИмяФайла(КоллекцияПечатныхФорм, Описание, МассивОбъектов);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Печатные формы лида: заказ покупателя и накладная на доставку.
//
// Возвращаемое значение:
//  Массив из Структура - описания печатных форм:
//   * ИмяМакета       - Строка - идентификатор печатной формы
//   * Представление   - Строка - название для пользователя
//   * ПутьКМакету     - Строка - путь макета для правки пользователем
//   * НазваниеВФайле  - Строка - французское название документа в имени файла
//
Функция ОписанияПечатныхФорм()

	Описания = Новый Массив;

	Описание = Новый Структура("ИмяМакета, Представление, ПутьКМакету, НазваниеВФайле");
	Описание.ИмяМакета = "Заказ";
	Описание.Представление = НСтр("ru = 'Заказ покупателя'; fr = 'Commande client';
		|en = 'Customer order'; es = 'Pedido de cliente'");
	Описание.ПутьКМакету = "РегистрСведений.Лиды.Заказ";
	Описание.НазваниеВФайле = "Commande client";
	Описания.Добавить(Описание);

	Описание = Новый Структура("ИмяМакета, Представление, ПутьКМакету, НазваниеВФайле");
	Описание.ИмяМакета = "ТН";
	Описание.Представление = НСтр("ru = 'Накладная на доставку'; fr = 'Bon de livraison';
		|en = 'Delivery note'; es = 'Albarán de entrega'");
	Описание.ПутьКМакету = "РегистрСведений.Лиды.ТН";
	Описание.НазваниеВФайле = "Bon de livraison";
	Описания.Добавить(Описание);

	Возврат Описания;

КонецФункции

// Выводит одну печатную форму лида.
//
// Параметры:
//  ИмяМакета - Строка                            - идентификатор печатной формы
//  Док       - ДокументСсылка.ЗаказПокупателя     - печатаемый заказ
//  Таб       - ТабличныйДокумент                  - документ вывода
//  Контакты  - Структура                          - НомерТелефона и EMail покупателя
//
Процедура ВывестиПечатнуюФорму(ИмяМакета, Док, Таб, Контакты)

	Если ИмяМакета = "Заказ" Тогда
		ПечатьЗаказа(Док, Таб, Контакты);
	Иначе
		ПечатьТН(Док, Таб, Контакты);
	КонецЕсли;

КонецПроцедуры

// Имя файла печатной формы: французское название документа с номером и датой заказа,
// как это было при печати из карточки лида.
//
// Параметры:
//  КоллекцияПечатныхФорм - ТаблицаЗначений - коллекция с готовой печатной формой
//  Описание              - Структура       - см. ОписанияПечатныхФорм
//  МассивОбъектов        - Массив          - печатаемые заказы
//
Процедура УстановитьИмяФайла(КоллекцияПечатныхФорм, Описание, МассивОбъектов)

	Если МассивОбъектов.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;

	Строка = КоллекцияПечатныхФорм.Найти(Описание.ИмяМакета, "ИмяМакета");
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МассивОбъектов[0], "Номер, Дата");
	Строка.ИмяФайла = Описание.НазваниеВФайле + " № " + Реквизиты.Номер
		+ " du " + Формат(Реквизиты.Дата, "Л=fr; ДЛФ=DD");

КонецПроцедуры

Процедура ПечатьЗаказа(Док, Таб, Контакты)
	Макет = ПечатныеФормы.МакетПечатнойФормы("РегистрСведений.Лиды.Заказ");
	// Шапка
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = "Commande client № " + Док.Номер + " du " + Формат(Док.Дата, "Л=fr; ДЛФ=DD");
	Таб.Вывести(оЗаголовок);
	
	оПокупатель = Макет.ПолучитьОбласть("Покупатель");
	оПокупатель.Параметры.ПредставлениеПокупателя = Док.Контрагент.Наименование
	+ ", tel.: " + Контакты.НомерТелефона + ", e-mail: " + Контакты.EMail ;
	Таб.Вывести(оПокупатель);
	
	оШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Таб.Вывести(оШапкаТаблицы);
	// Строки
	Ном = 0;
	Для Каждого Стр Из Док.ТЧТовары Цикл
		Ном = Ном + 1;
		оСтрока = Макет.ПолучитьОбласть("Строка");
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.НомерСтроки = Ном;
		оСтрока.Параметры.Товар = Стр.Номенклатура;	
		оСтрока.Параметры.Единица = Стр.Номенклатура.Единица;	
		Таб.Вывести(оСтрока);
		Ном = Ном + 1;	
	КонецЦикла;	
	оПодвалТаблицы = Макет.ПолучитьОбласть("Итого");
	оПодвалТаблицы.Параметры.СуммаИтого = Док.ТЧТОвары.Итог("Сумма");
	Таб.Вывести(оПодвалТаблицы);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.АвтоМасштаб = Истина;
КонецПроцедуры

Процедура ПечатьТН(Док, Таб, Контакты)
	Макет = ПечатныеФормы.МакетПечатнойФормы("РегистрСведений.Лиды.ТН");
	// Шапка
	оЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	оЗаголовок.Параметры.ТекстЗаголовка = "Bon de livraison № " + Док.Номер + " du " + Формат(Док.Дата, "Л=fr; ДЛФ=DD");
	Таб.Вывести(оЗаголовок);
	
	оПокупатель = Макет.ПолучитьОбласть("Покупатель");
	оПокупатель.Параметры.ПредставлениеПокупателя = Док.Контрагент.Наименование
	+ ", tel.: " + Контакты.НомерТелефона + ", e-mail: " + Контакты.EMail ;
	Таб.Вывести(оПокупатель);
	
	оШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Таб.Вывести(оШапкаТаблицы);
	// Строки
	Ном = 0;
	Для Каждого Стр Из Док.ТЧТовары Цикл
		Ном = Ном + 1;
		оСтрока = Макет.ПолучитьОбласть("Строка");
		оСтрока.Параметры.Заполнить(Стр);
		оСтрока.Параметры.НомерСтроки = Ном;
		оСтрока.Параметры.Товар = Стр.Номенклатура;	
		оСтрока.Параметры.Единица = Стр.Номенклатура.Единица;	
		Таб.Вывести(оСтрока);
		Ном = Ном + 1;	
	КонецЦикла;	
	оПодвалТаблицы = Макет.ПолучитьОбласть("Итого");
	оПодвалТаблицы.Параметры.СуммаИтого = Док.ТЧТОвары.Итог("Сумма");
	Таб.Вывести(оПодвалТаблицы);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.АвтоМасштаб = Истина;
КонецПроцедуры

#КонецОбласти

#КонецОбласти
